<template>
  <div class="content">
    <div class="statistics">
      <h4>当日数据统计</h4>
      <div class="box green">
        <span>927MB</span>
        <span>流量</span>
      </div>
      <div class="box yellow">
        <span>927个</span>
        <span>文件</span>
      </div>
      <div class="box blue">
        <span>927条</span>
        <span>数据库</span>
      </div>
    </div>

    <div class="taskFlow">
      <h4>任务流量（15日</h4>
      <div id="chart" />
    </div>
  </div>
</template>
<script>
export default {
  name: 'Statistics',
  data() {
    return {}
  },
  mounted() {
    this.setcharts()
  },
  methods: {
    setcharts: function() {
      var myChart = this.$echarts.init(document.getElementById('chart'))

      var option = {
        tooltip: {
          trigger: 'axis',
          transitionDuration: 0, // 防止tooltip的抖动
          axisPointer: {
            type: 'line',
            lineStyle: {
              color: 'rgba(0,0,0,0.2)',
              width: 1,
              type: 'solid'
            }
          }
        },

        legend: {
          data: ['任务一', '任务二', '任务三', '任务四', '任务五']
        },

        singleAxis: {
          top: 50,
          bottom: 50,
          axisTick: {},
          axisLabel: {},
          type: 'time',
          axisPointer: {
            animation: true,
            label: {
              show: true
            }
          },
          splitLine: {
            show: true,
            lineStyle: {
              type: 'dashed',
              opacity: 0.2
            }
          }
        },

        series: [
          {
            type: 'themeRiver',
            emphasis: {
              itemStyle: {
                shadowBlur: 20,
                shadowColor: 'rgba(0, 0, 0, 0.8)'
              }
            },
            data: [['2015/11/08', 10, '任务一'], ['2015/11/09', 15, '任务一'], ['2015/11/10', 35, '任务一'],
              ['2015/11/11', 38, '任务一'], ['2015/11/12', 22, '任务一'], ['2015/11/13', 16, '任务一'],
              ['2015/11/14', 7, '任务一'], ['2015/11/15', 2, '任务一'], ['2015/11/16', 17, '任务一'],
              ['2015/11/17', 33, '任务一'], ['2015/11/18', 40, '任务一'], ['2015/11/19', 32, '任务一'],
              ['2015/11/20', 26, '任务一'], ['2015/11/21', 35, '任务一'], ['2015/11/22', 40, '任务一'],
              ['2015/11/23', 32, '任务一'], ['2015/11/24', 26, '任务一'], ['2015/11/25', 22, '任务一'],
              ['2015/11/26', 16, '任务一'], ['2015/11/27', 22, '任务一'], ['2015/11/28', 10, '任务一'],
              ['2015/11/08', 35, '任务二'], ['2015/11/09', 36, '任务二'], ['2015/11/10', 37, '任务二'],
              ['2015/11/11', 22, '任务二'], ['2015/11/12', 24, '任务二'], ['2015/11/13', 26, '任务二'],
              ['2015/11/14', 34, '任务二'], ['2015/11/15', 21, '任务二'], ['2015/11/16', 18, '任务二'],
              ['2015/11/17', 45, '任务二'], ['2015/11/18', 32, '任务二'], ['2015/11/19', 35, '任务二'],
              ['2015/11/20', 30, '任务二'], ['2015/11/21', 28, '任务二'], ['2015/11/22', 27, '任务二'],
              ['2015/11/23', 26, '任务二'], ['2015/11/24', 15, '任务二'], ['2015/11/25', 30, '任务二'],
              ['2015/11/26', 35, '任务二'], ['2015/11/27', 42, '任务二'], ['2015/11/28', 42, '任务二'],
              ['2015/11/08', 21, '任务三'], ['2015/11/09', 25, '任务三'], ['2015/11/10', 27, '任务三'],
              ['2015/11/11', 23, '任务三'], ['2015/11/12', 24, '任务三'], ['2015/11/13', 21, '任务三'],
              ['2015/11/14', 35, '任务三'], ['2015/11/15', 39, '任务三'], ['2015/11/16', 40, '任务三'],
              ['2015/11/17', 36, '任务三'], ['2015/11/18', 33, '任务三'], ['2015/11/19', 43, '任务三'],
              ['2015/11/20', 40, '任务三'], ['2015/11/21', 34, '任务三'], ['2015/11/22', 28, '任务三'],
              ['2015/11/23', 26, '任务三'], ['2015/11/24', 37, '任务三'], ['2015/11/25', 41, '任务三'],
              ['2015/11/26', 46, '任务三'], ['2015/11/27', 47, '任务三'], ['2015/11/28', 41, '任务三'],
              ['2015/11/08', 10, '任务四'], ['2015/11/09', 15, '任务四'], ['2015/11/10', 35, '任务四'],
              ['2015/11/11', 38, '任务四'], ['2015/11/12', 22, '任务四'], ['2015/11/13', 16, '任务四'],
              ['2015/11/14', 7, '任务四'], ['2015/11/15', 2, '任务四'], ['2015/11/16', 17, '任务四'],
              ['2015/11/17', 33, '任务四'], ['2015/11/18', 40, '任务四'], ['2015/11/19', 32, '任务四'],
              ['2015/11/20', 26, '任务四'], ['2015/11/21', 35, '任务四'], ['2015/11/22', 40, '任务四'],
              ['2015/11/23', 32, '任务四'], ['2015/11/24', 26, '任务四'], ['2015/11/25', 22, '任务四'],
              ['2015/11/26', 16, '任务四'], ['2015/11/27', 22, '任务四'], ['2015/11/28', 10, '任务四'],
              ['2015/11/08', 10, '任务五'], ['2015/11/09', 15, '任务五'], ['2015/11/10', 35, '任务五'],
              ['2015/11/11', 38, '任务五'], ['2015/11/12', 22, '任务五'], ['2015/11/13', 16, '任务五'],
              ['2015/11/14', 7, '任务五'], ['2015/11/15', 2, '任务五'], ['2015/11/16', 17, '任务五'],
              ['2015/11/17', 33, '任务五'], ['2015/11/18', 40, '任务五'], ['2015/11/19', 32, '任务五'],
              ['2015/11/20', 26, '任务五'], ['2015/11/21', 35, '任务五'], ['2015/11/22', 4, '任务五'],
              ['2015/11/23', 32, '任务五'], ['2015/11/24', 26, '任务五'], ['2015/11/25', 22, '任务五'],
              ['2015/11/26', 16, '任务五'], ['2015/11/27', 22, '任务五'], ['2015/11/28', 10, '任务五']
            ]
          }
        ]
      }
      myChart.setOption(option)
      window.onresize = function() {
        myChart.resize()
      }
    }
  }
}
</script>
<style lang="scss" scoped>
.content {
  display: flex;
  height: 300px;
  .statistics {
    width: 30%;
    height: 100%;
    background: #fff;
    border-radius: 5px;
    padding: 15px;
    font-size: 14px;
    margin-top: 10px;
    margin-right: 10px;
    h4 {
      font-size: 16px;
    }
    .box {
      height: 54px;
      padding: 10px;
      margin: 10px;
      display: flex;
      flex-direction: column;
      align-items: center;
      color: #fff;
      font-weight: bold;
      font-size: 16px;
      border-radius: 5px;
    }
    .green {
      background-color: #0adea3;
    }
    .yellow {
      background-color: #e8c73a;
    }
    .blue {
      background-color: #30c7cd;
    }
  }
  .taskFlow {
    width: 70%;
    height: 100%;
    background: #fff;
    border-radius: 5px;
    padding: 15px;
    font-size: 14px;
    margin-top: 10px;
    // margin-right: 10px;
    #chart {
      width: 100%;
      height: 280px;
    }
  }
}
</style>
